{
  "format": "layers-model",
  "generatedBy": "keras v2.6.0",
  "convertedBy": "TensorFlow.js Converter v3.9.0",
  "modelTopology": {
    "keras_version": "2.6.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_7",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, null],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "embedding_7_input"
            }
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_7",
              "trainable": true,
              "batch_input_shape": [null, null],
              "dtype": "float32",
              "input_dim": 50000,
              "output_dim": 13,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_7",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [5],
              "strides": [1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d_7",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last",
              "keepdims": false
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_14",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_15",
              "trainable": true,
              "dtype": "float32",
              "units": 2,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "conv1d_7/kernel",
          "shape": [5, 13, 128],
          "dtype": "float32"
        },
        { "name": "conv1d_7/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_14/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "dense_14/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_15/kernel", "shape": [64, 2], "dtype": "float32" },
        { "name": "dense_15/bias", "shape": [2], "dtype": "float32" },
        {
          "name": "embedding_7/embeddings",
          "shape": [50000, 13],
          "dtype": "float32"
        }
      ]
    }
  ]
}
